Moving the Witness Line conflicts with other Constraints in the Sketch.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotDragWitnessLine { get; }
  Visual Basic
Public Shared ReadOnly Property CannotDragWitnessLine As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotDragWitnessLine {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures DimensionFailures Class
  Autodesk.Revit.DB Namespace